package Data.Database
{
	internal class Option
	{
		public function Option()
		{
		}
static public var set_option:Array = [
["狂戦士",6,
	["力 +10","力","10"],
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["AG +20","AG","20"],
	["AG 増加量 +5","AG 増加量","5"],
	["防御力 +20","防御力","20"],
	["敏捷 +10","敏捷","10"],
	[
		["クリティカルダメージ確率 +5%","クリティカルダメージ確率","5"],
		["エクセレントダメージ確率 +5%","エクセレントダメージ確率","5"],
		["力 +25","力","25"]
	]
],
["ハイペリオン",2,
	["エナジー +15","エナジー","15"],
	["敏捷 +15","敏捷","15"],
	[
		["スキル攻撃力 +20","スキル攻撃力","20"],
		["マナ +30","マナ","30"]
	]
],
["アプルナス",4,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["攻撃成功率 +50","攻撃成功率","50"],
	["魔力 +5%","魔力","5"],
	["生命 +50","生命","50"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["AG +30","AG","30"]
	]
],
["ガルーダ",4,
	["AG +30","AG","30"],
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	["エナジー +15","エナジー","15"],
	["生命 +50","生命","50"],
	[
		["スキル攻撃力 +25","スキル攻撃力","25"],
		["魔力 +15%","魔力","15"]
	]
],
["カンタータ",4,
	["エナジー +15","エナジー","15"],
	["体力 +30","体力","30"],
	["魔力 +10%","魔力","10"],
	["力 +15","力","15"],
	[
		["スキル攻撃力 +25","スキル攻撃力","25"],
		["エクセレントダメージ +20","エクセレントダメージ","20"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"]
	]
],
["ハイオン",3,
	["防御力 +25","防御力","25"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["アポロ",6,
	["エナジー +10","エナジー","10"],
	["魔力 +5%","魔力","5"],
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["マナ +30","マナ","30"],
	["生命 +30","生命","30"],
	["AG +20","AG","20"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["エナジー +30","エナジー","30"]
	]
],
["阿修羅",3,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["体力 +20","体力","20"],
	["魔力 +10%","魔力","10"],
	[
		["AG 増加量 +5","AG","5"],
		["攻撃成功率 +50","攻撃成功率","50"],
		["ダブルダメージ確率 +5%","ダブルダメージ確率","5"]
	]
],
["ヘラス",5,
	["力 +15","力","15"],
	["魔力 +10%","魔力","10"],
	["盾装備時、防御力 +5%","盾装備時、防御力","5"],
	["エナジー +15","エナジー","15"],
	["攻撃成功率 +50","攻撃成功率","50"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["生命 +50","生命","50"],
		["マナ +50","マナ","50"]
	]
],
["アヌビス",3,
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["マナ +50","マナ","50"],
	["魔力 +10%","魔力","10"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["セト",5,
	["敏捷 +10","敏捷","10"],
	["生命 +50","生命","50"],
	["防御力 +20","防御力","20"],
	["盾装備時、防御力 +5%","盾装備時、防御力","5"],
	["エナジー +10","エナジー","10"],
	[
		["生命 +50","生命","50"],
		["力 +20","力","20"]
	]
],
["ガイア",4,
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["マナ +25","マナ","25"],
	["力 +10","力","10"],
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	[
		["敏捷 +30","敏捷","30"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["エクセレントダメージ +10","エクセレントダメージ","10"]
	]
],
["オーディーン",4,
	["エナジー +15","エナジー","15"],
	["生命 +50","生命","50"],
	["攻撃成功率 +50","攻撃成功率","50"],
	["敏捷 +30","敏捷","30"],
	[
		["敵の防御力無視 +5%","敵の防御力無視","5"],
		["マナ +50","マナ","50"],
		["AG +50","AG","50"]
	]
],
["アルゴス",2,
	["最大攻撃力 +20","最大攻撃力","20"],
	["スキル攻撃力 +25","スキル攻撃力","25"],
	[
		["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
		["AG +50","AG","50"]
	]
],
["ガウェイン",4,
	["敏捷 +30","敏捷","30"],
	["最小攻撃力 +20","最小攻撃力","20"],
	["防御力 +20","防御力","20"],
	["最大攻撃力 +20","最大攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["バンガイオン",3,
	["敵の防御力無視 +5%","敵の防御力無視","5"],
	["ダブルダメージ確率 +15%","ダブルダメージ確率","15"],
	["スキル攻撃力 +15","スキル攻撃力","15"],
	[
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +30","エクセレントダメージ","30"],
		["力 +30","力","30"],
		["魔力 +10%","魔力","10"]
	]
],
["ヴィシャス",3,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["ダメージ増加 +15","ダメージ増加","15"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["最小攻撃力 +20","最小攻撃力","20"],
		["最大攻撃力 +30","最大攻撃力","30"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["イシス",3,
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["エナジー +30","エナジー","30"],
	[
		["魔力 +10%","魔力","10"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["アルアン",3,
	["ダメージ増加 +10","ダメージ増加","10"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["ミュレン",3,
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["魔力 +10%","魔力","10"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["防御力 +25","防御力","25"],
		["両手剣装備時ダメージ増加 +20%","両手剣装備時ダメージ増加","20"]
	]
],
["アグニス",3,
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["防御力 +40","防御力","40"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["ブロイ",3,
	["ダメージ増加 +20","ダメージ増加","20"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	["エナジー +30","エナジー","30"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"],
		["統率 +30","統率","30"]
	]
],
["クロノ",3,
	["ダブルダメージ確率 +20%","ダブルダメージ確率","20"],
	["防御力 +60","防御力","60"],
	["スキル攻撃力 +30","スキル攻撃力","30"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["セメデン",3,
	["魔力 +15%","魔力","15"],
	["スキル攻撃力 +25","スキル攻撃力","25"],
	["エナジー +30","エナジー","30"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["無名",3,
	["生命 +50","生命","50"],
	["敏捷 +50","敏捷","50"],
	["盾装備時、防御力 +25%","盾装備時、防御力","25"],
	[
		["ダメージ増加 +30","ダメージ増加","30"]
	]
],
["ミスト",2,
	["体力 +20","体力","20"],
	["スキル攻撃力 +30","スキル攻撃力","30"],
	[
		["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
		["敏捷 +20","敏捷","20"]
	]
],
["グリード",4,
	["最大攻撃力 +10","最大攻撃力","10"],
	["最大攻撃力 +20","最大攻撃力","20"],
	["最大攻撃力 +30","最大攻撃力","30"],
	["最大攻撃力 +40","最大攻撃力","40"],
	[
		["スキル攻撃力 +40","スキル攻撃力","40"],
		["力 +40","力","40"]
	]
],
["クラウド",1,
	["クリティカルダメージ確率 +20%","クリティカルダメージ確率","20"],
	[
		["クリティカルダメージ +50","クリティカルダメージ","50"]
	]
],
["レイブ",2,
	["スキル攻撃力 +20","スキル攻撃力","20"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["両手剣装備時ダメージ増加 +30%","両手剣装備時ダメージ増加","30"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["バネク",2,
	["魔力 +10%","魔力","10"],
	["エナジー +20","エナジー","20"],
	[
		["スキル攻撃力 +30","スキル攻撃力","30"],
		["マナ +100","マナ","100"]
	]
],
["シリオン",3,
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	["クリティカルダメージ確率 +5%","クリティカルダメージ確率","5"],
	["防御力 +20","防御力","20"],
	[
		["力 +50","力","50"],
		["敏捷 +50","敏捷","50"],
		["体力 +50","体力","50"],
		["エナジー +50","エナジー","50"]
	]
],
["ミネ",2,
	["エナジー +30","エナジー","30"],
	["防御力 +30","防御力","30"],
	[
		["マナ +100","マナ","100"],
		["スキル攻撃力 +15","スキル攻撃力","15"]
	]
],
["ドラーク",3,
	["敏捷 +20","敏捷","20"],
	["ダメージ増加 +25","ダメージ増加","25"],
	["ダブルダメージ確率 +20%","ダブルダメージ確率","20"],
	[
		["防御力 +40","防御力","40"],
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"]
	]
],
["フェイズ",2,
	["生命 +100","生命","100"],
	["マナ +100","マナ","100"],
	[
		["防御力 +100","防御力","100"]
	]
],
["アルビアン",1,
	["敏捷 +30","敏捷","30"],
	[
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["カリス",2,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["敏捷 +40","敏捷","40"]
	]
],
["ベガ",3,
	["攻撃成功率 +50","攻撃成功率","50"],
	["体力 +50","体力","50"],
	["最大攻撃力 +30","最大攻撃力","30"],
	[
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["チャメル",3,
	["防御力 +50","防御力","50"],
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	["ダメージ増加 +30","ダメージ増加","30"],
	[
		["クリティカルダメージ +30","クリティカルダメージ","30"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["スキル攻撃力 +30","スキル攻撃力","30"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["ラッキーLV1",4,
	["生命 +30","生命","30"],
	["防御力 +20","防御力","20"],
	["スキル攻撃力 +25","スキル攻撃力","25"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["クリティカルダメージ +10","クリティカルダメージ","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["エクセレントダメージ +10","エクセレントダメージ","10"]
	]
],
["ラッキーLV2",4,
	["生命 +50","生命","50"],
	["防御力 +40","防御力","40"],
	["ダブルダメージ確率 +15%","ダブルダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["ラッキー LV2",3,
	["生命 +50","生命","50"],
	["防御力 +40","防御力","40"],
	["ダブルダメージ確率 +15%","ダブルダメージ確率","15"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +20","エクセレントダメージ","20"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["マヘス",1,
	["生命 +100","生命","100"],
	[
		["盾装備時、防御力 +17%","盾装備時、防御力","17"],
		["敵の防御力無視 +6%","敵の防御力無視","6"]
	]
],
["ブラギ",4,
	["力 +10","力","10"],
	["力 +20","力","20"],
	["力 +30","力","30"],
	["生命 +10","生命","50"],
	[
		["最小攻撃力 +30","最小攻撃力","30"],
		["両手剣装備時ダメージ増加 +6%","両手剣装備時ダメージ増加","6"],
		["ダブルダメージ確率 +3%","ダブルダメージ確率","3"],
		["スキル攻撃力 +50","スキル攻撃力","50"]
	]
],
["ベス",1,
	["エナジー +200","エナジー","200"],
	[
		["魔力 +9%","魔力","9"],
		["スキル攻撃力 +80","スキル攻撃力","80"]
	]
],
["アルヴィト",4,
	["ダブルダメージ確率 +1%","ダブルダメージ確率","1"],
	["ダブルダメージ確率 +2%","ダブルダメージ確率","2"],
	["ダブルダメージ確率 +3%","ダブルダメージ確率","3"],
	["エナジー +10","エナジー","10"],
	[
		["クリティカルダメージ確率 +8%","クリティカルダメージ確率","8"],
		["エクセレントダメージ確率 +8%","エクセレントダメージ確率","8"],
		["盾装備時、防御力 +8%","盾装備時、防御力","8"],
		["敵の防御力無視 +1%","敵の防御力無視","1"]
	]
],
["セルケト",1,
	["敏捷 +40","敏捷","40"],
	[
		["防御力 +90","防御力","90"],
		["ダメージ増加 +40","ダメージ増加","40"]
	]
],
["フリッグ",4,
	["最小攻撃力 +40","最小攻撃力","40"],
	["最大攻撃力 +40","最大攻撃力","40"],
	["最小攻撃力 +50","最小攻撃力","50"],
	["最大攻撃力 +50","最大攻撃力","50"],
	[
		["クリティカルダメージ確率 +7%","クリティカルダメージ確率","7"],
		["エクセレントダメージ確率 +7%","エクセレントダメージ確率","7"],
		["生命 +50","生命","50"],
		["防御力 +20","防御力","20"]
	]
],
["ハピ",1,
	["敏捷 +10","敏捷","10"],
	[
		["敵の防御力無視 +1%","敵の防御力無視","1"],
		["防御力 +40","防御力","40"]
	]
],
["エルルーン",4,
	["エクセレントダメージ確率 +8%","エクセレントダメージ確率","8"],
	["エクセレントダメージ確率 +9%","エクセレントダメージ確率","9"],
	["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
	["ダブルダメージ確率 +12%","ダブルダメージ確率","12"],
	[
		["スキル攻撃力 +80","スキル攻撃力","80"],
		["防御力 +40","防御力","40"],
		["マナ +200","マナ","200"],
		["魔力 +13%","魔力","13"]
	]
],
["アピス",1,
	["力 +60","力","60"],
	[
		["クリティカルダメージ +40","クリティカルダメージ","40"],
		["エクセレントダメージ +40","エクセレントダメージ","40"]
	]
],
["テュール",4,
	["力 +20","力","20"],
	["敏捷 +20","敏捷","20"],
	["体力 +20","体力","20"],
	["エナジー +20","エナジー","20"],
	[
		["ダブルダメージ確率 +1%","ダブルダメージ確率","1"],
		["魔力 +1%","魔力","1"],
		["両手剣装備時ダメージ増加 +6%","両手剣装備時ダメージ増加","6"],
		["エクセレントダメージ確率 +12%","エクセレントダメージ確率","12"]
	]
],
["コンス",1,
	["生命 +200","生命","200"],
	[
		["クリティカルダメージ確率 +3%","クリティカルダメージ確率","3"],
		["エクセレントダメージ確率 +3%","エクセレントダメージ確率","3"]
	]
],
["スルト",4,
	["盾装備時、防御力 +2%","盾装備時、防御力","2"],
	["防御力 +20","防御力","20"],
	["力 +30","力","30"],
	["生命 +70","生命","70"],
	[
		["クリティカルダメージ確率 +11%","クリティカルダメージ確率","11"],
		["クリティカルダメージ +80","クリティカルダメージ","80"],
		["スキル攻撃力 +40","スキル攻撃力","40"],
		["エナジー +60","エナジー","60"]
	]
],
["ホルス",1,
	["最小攻撃力 +80","最小攻撃力","80"],
	[
		["ダブルダメージ確率 +4%","ダブルダメージ確率","4"],
		["スキル攻撃力 +60","スキル攻撃力","60"]
	]
],
["マグニ",4,
	["最大攻撃力 +5","最大攻撃力","5"],
	["最大攻撃力 +10","最大攻撃力","10"],
	["最大攻撃力 +15","最大攻撃力","15"],
	["生命 +100","生命","100"],
	[
		["防御力 +50","防御力","50"],
		["エクセレントダメージ確率 +8%","エクセレントダメージ確率","8"],
		["エクセレントダメージ +10","エクセレントダメージ","10"],
		["ダメージ増加 +60","ダメージ増加","60"]
	]
]
];
//エンチャントOP
//name type 0:武器 1:杖 2:防具 lv
static public var enchant:Array = [
	["",0,0,[""]],
	["最小攻撃力",0,0,["2","3","4","5","6","7","9","11","12","14","15","16","17","20"]],
	["最大攻撃力",0,0,["3","4","5","6","7","8","10","12","14","17","20","23","26","29"]],
	["要求力減",0,0,["6","8","10","12","14","16","20","23","26","29","32","35","37","40"]],
	["要求敏減",0,0,["6","8","10","12","14","16","20","23","26","29","32","35","37","40"]],
	["攻撃力",0,6,["7","8","9","11","12","14","16","19"]],
	["Cダメ",0,6,["12","14","16","18","20","22","24","30"]],
	["スキル攻撃力",0,9,["12","14","16","18","22"]],
	["対人攻撃率",0,9,["5","7","9","11","14"]],
	["SD比率減",0,9,["3%","5%","7%","9%","10%"]],
	["SD無視",0,13,["10%"]],
	//杖エンチャ
	["",1,0,[""]],
	["魔力上昇",1,0,["6","8","10","12","14","16","17","18","19","21","23","25","27","31"]],
	["要求力減",1,0,["6","8","10","12","14","16","20","23","26","29","32","35","37","40"]],
	["要求敏減",1,0,["6","8","10","12","14","16","20","23","26","29","32","35","37","40"]],
	["スキル攻撃力",1,6,["7","10","13","16","19","22","25","30"]],
	["Cダメ",1,6,["10","12","14","16","18","20","22","28"]],
	["対人攻撃率",1,9,["5","7","9","11","14"]],
	["SD比率減",1,9,["4%","6%","8%","10%","13%"]],
	["SD無視",1,13,["15%"]],
	//防具エンチャ
	["",2,0,[""]],
	["防御力上昇",2,0,["3","4","5","6","7","8","10","12","14","16","18","20","22","25"]],
	["最大AG上昇",2,3,["4","6","8","10","12","14","16","18","20","22","25"]],
	["最大生命上昇",2,3,["7","9","11","13","15","17","19","21","23","25","30"]],
	["自動生命回復",2,6,["1","2","3","4","5","6","7","8"]],
	["自動マナ回復",2,9,["1","2","3","4","5"]],
	["対人防御成功",2,9,["3","4","5","6","8"]],
	["ダメ減",2,9,["3%","4%","5%","6%","7%"]],
	["SD比率上昇",2,13,["5%"]]
];
//ソケットOP
static public var socket:Array = [
	//名前 属性 v1.LV1の値 v2 v3 v4 v5
	["",""	,["","","","",""]],
	//炎
	["攻撃魔力lv","炎"	,["20分の1","19分の1","18分の1","17分の1","14分の1"]],
	["最大攻撃魔力","炎"	,["30","32","35","40","50"]],
	["最小攻撃魔力","炎"	,["20","22","25","30","35"]],
	["攻撃魔力増加","炎"	,["20","22","25","30","35"]],
	["速度増加","炎"		,["7","8","9","10","11"]],
	["AG消費減少","炎"	,["40%","41%","42%","43%","44%"]],
	//稲妻
	["EXD増加","稲妻"	,["15","20","25","30","40"]],
	["EXD確率","稲妻"	,["10%","11%","12%","13%","14%"]],
	["クリ増加","稲妻"	,["30","32","35","40","50"]],
	["クリ確率","稲妻"	,["8%","9%","10%","11%","12%"]],
	//氷
	["スキル増加","氷"	,["37","40","45","50","60"]],
	["獲得生命","氷"	,["8分の1","7分の1","6分の1","5分の1","4分の1"]],
	["獲得マナ","氷"	,["8分の1","7分の1","6分の1","5分の1","4分の1"]],
	["攻撃成功率","氷"	,["25","27","30","35","40"]],
	["アイテム耐久","氷",["30%","32%","34%","36%","38%"]]
];
static public var socket2:Array = [
	//水
	["",""		,["","","","",""]],
	["防御力増加","水"		,["30","33","36","39","42"]],
	["盾装備時増加","水"	,["7%","10%","15%","20%","30%"]],
	["ダメ減","水"			,["4%","5%","6%","7%","8%"]],
	["ダメ反","水"			,["5%","6%","7%","8%","9%"]],
	["防御成功","水"		,["10%","11%","12%","13%","14%"]],
	//風
	["最大生命増加","風"		,["4%","5%","6%","7%","8%"]],
	["最大マナ増加","風"		,["4%","5%","6%","7%","8%"]],
	["最大AG増加","風"			,["25","30","35","40","50"]],
	["自動生命回復","風"	,["8","10","13","16","20"]],
	["自動マナ回復","風"	,["7","14","21","28","35"]],
	["自動AG回復","風"	,["3","5","7","10","15"]],
	//地
	["体力増加","地"		,["30","32","34","36","38"]]
];
	}
}