package Data.Database{
	internal class SetWeapon{
		public static var data:Array = [
["狂戦士のモーニングスター",40,"力","狂戦士"],
["ハイオンの稲妻の剣",10,"力","ハイオン"],
["アポロの骸骨の杖",80,"エナジー","アポロ"],
["セトのレイピア",2,"力","セト"],
["ガウェインのプラチナボウ",62,"敏捷","ガウェイン"],
["ガイアのガストラ",70,"敏捷","ガイア"],
["ベガのセイクリッドグローブ",117,"力","ベガ"],
["チャメルのセイクリッドグローブ",117,"力","チャメル"],
["ブラギのダークブレイカー",23,"力","ブラギ"],
["ベスの破壊の杖",88,"エナジー","ベス"],
["アルヴィトのルシファーの杖",89,"エナジー","アルヴィト"],
["フリッグのホーリーサイトボウ",64,"敏捷","フリッグ"],
["エルルーンのデモニックロッド",110,"エナジー","エルルーン"],
["テュールのデスブレード",22,"力","テュール"],
["スルトのロードセプター",99,"力","スルト"],
["ホルスのホーリーストームクロー",118,"力","ホルス"],
["マグニのピアシングブレードグローブ",119,"力","マグニ"]
];
	}
}