package Data.Database
{
	internal class Accessory
	{
		static public var neck:Array = [
["アクセサリ","稲妻のネックレス","通常","ネックレス","AH",[1,1,1,1,1,1,1],21,0,"稲妻","","",,],
["アクセサリ","炎のネックレス","通常","ネックレス","AH",[1,1,1,1,1,1,1],13,0,"炎","","",,],
["アクセサリ","氷のネックレス","通常","ネックレス","AH",[1,1,1,1,1,1,1],34,0,"氷","","",,],
["アクセサリ","風のネックレス","通常","ネックレス","AH",[1,1,1,1,1,1,1],42,0,"風","","",,],
["アクセサリ","水のネックレス","通常","ネックレス","AH",[1,1,1,1,1,1,1],46,0,"水","","",,],
["アクセサリ","スキルのネックレス","通常","ネックレス","最大AG",[1,1,1,1,1,1,1],50,0,"なし","","",,]];
		static public var ring:Array = [
["アクセサリ","氷のリング","通常","リング","AH",[1,1,1,1,1,1,1],20,0,"氷","","",,,],
["アクセサリ","毒のリング","通常","リング","AH",[1,1,1,1,1,1,1],17,0,"毒","","",,,],
["アクセサリ","炎のリング","通常","リング","AH",[1,1,1,1,1,1,1],30,0,"炎","","",,,],
["アクセサリ","風のリング","通常","リング","AH",[1,1,1,1,1,1,1],44,0,"風","","",,,],
["アクセサリ","地のリング","通常","リング","AH",[1,1,1,1,1,1,1],38,0,"地","","",,,],
["アクセサリ","魔法のリング","通常","リング","最大マナ",[1,1,1,1,1,1,1],47,0,"なし","","",,,]];
		static public var shop_neck:Array = [
["アクセサリ","サファイアネックレス","ショップ","ネックレス","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","エメラルドネックレス","ショップ","ネックレス","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","ルビーネックレス","ショップ","ネックレス","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,]
];
		static public var shop_ring:Array = [
["アクセサリ","アメジストリング","ショップ","リング","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","トパーズリング","ショップ","リング","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","ルビーリング","ショップ","リング","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","サファイアリング","ショップ","リング","AH3%",[1,1,1,1,1,1,1],0,0,"なし","","",,,]
];
	}
}