package Data.Database
{
	internal class Shop
	{
		public function Shop()
		{
		}
		
static public var neck:Array = [
["アクセサリ","サファイアネックレス","ショップ","ネックレス",,[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","エメラルドネックレス","ショップ","ネックレス",,[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","ルビーネックレス","ショップ","ネックレス",,[1,1,1,1,1,1,1],0,0,"なし","","",,,]
];
		
static public var ring:Array = [
["アクセサリ","アメジストリング","ショップ","リング",,[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","トパーズリング","ショップ","リング",,[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","ルビーリング","ショップ","リング",,[1,1,1,1,1,1,1],0,0,"なし","","",,,],
["アクセサリ","サファイアリング","ショップ","リング",,[1,1,1,1,1,1,1],0,0,"なし","","",,,]
];
	}
}