var set_option = [
["狂戦士",6,
	["力 +10","力","10"],
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["AG +20","AG","20"],
	["AG増加量 +5","AG増加量","5"],
	["防御力 +20","防御力","20"],
	["敏捷 +10","敏捷","10"],
	[
		["クリティカルダメージ確率 +5%","クリティカルダメージ確率","5"],
		["エクセレントダメージ確率 +5%","エクセレントダメージ確率","5"],
		["力 +25","力","25"]
	]
],
["ハイペリオン",2,
	["エナジー +15","エナジー","15"],
	["敏捷 +15","敏捷","15"],
	[
		["スキル攻撃力 +20","スキル攻撃力","20"],
		["マナ +30","マナ","30"]
	]
],
["アプルナス",4,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["攻撃成功率 +50","攻撃成功率","50"],
	["魔力 +5%","魔力","5"],
	["生命 +50","生命","50"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["AG +30","AG","30"]
	]
],
["ガルーダ",4,
	["AG +30","AG","30"],
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	["エナジー +15","エナジー","15"],
	["生命 +50","生命","50"],
	[
		["スキル攻撃力 +25","スキル攻撃力","25"],
		["魔力 +15%","魔力","15"]
	]
],
["カンタータ",4,
	["エナジー +15","エナジー","15"],
	["体力 +30","体力","30"],
	["魔力 +10%","魔力","10"],
	["力 +15","力","15"],
	[
		["スキル攻撃力 +25","スキル攻撃力","25"],
		["エクセレントダメージ +20","エクセレントダメージ","20"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"]
	]
],
["ハイオン",3,
	["防御力 +25","防御力","25"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["アポロ",6,
	["エナジー +10","エナジー","10"],
	["魔力 +5%","魔力","5"],
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["マナ +30","マナ","30"],
	["生命 +30","生命","30"],
	["AG +20","AG","20"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["エナジー +30","エナジー","30"]
	]
],
["阿修羅",3,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["体力 +20","体力","20"],
	["魔力 +10%","魔力","10"],
	[
		["AG 増加量 +5","AG","5"],
		["攻撃成功率 +50","攻撃成功率","50"],
		["ダブルダメージ確率 +5%","ダブルダメージ確率","5"]
	]
],
["ヘラス",5,
	["力 +15","力","15"],
	["魔力 +10%","魔力","10"],
	["盾装備時、防御力 +5%","盾装備時、防御力","5"],
	["エナジー +15","エナジー","15"],
	["攻撃成功率 +50","攻撃成功率","50"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["生命 +50","生命","50"],
		["マナ +50","マナ","50"]
	]
],
["アヌビス",3,
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["マナ +50","マナ","50"],
	["魔力 +10%","魔力","10"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["セト",5,
	["敏捷 +10","敏捷","10"],
	["生命 +50","生命","50"],
	["防御力 +20","防御力","20"],
	["盾装備時、防御力 +5%","盾装備時、防御力","5"],
	["エナジー +10","エナジー","10"],
	[
		["生命 +50","生命","50"],
		["力 +20","力","20"]
	]
],
["ガイア",4,
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["マナ +25","マナ","25"],
	["力 +10","力","10"],
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	[
		["敏捷 +30","敏捷","30"],
		["エクセレントダメージ確率 +10%","エクセレントダメージ確率","10"],
		["エクセレントダメージ +10","エクセレントダメージ","10"]
	]
],
["オーディーン",4,
	["エナジー +15","エナジー","15"],
	["生命 +50","生命","50"],
	["攻撃成功率 +50","攻撃成功率","50"],
	["敏捷 +30","敏捷","30"],
	[
		["敵の防御力無視 +5%","敵の防御力無視","5"],
		["マナ +50","マナ","50"],
		["AG +50","AG","50"]
	]
],
["アルゴス",2,
	["最大攻撃力 +20","最大攻撃力","20"],
	["スキル攻撃力 +25","スキル攻撃力","25"],
	[
		["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
		["AG +50","AG","50"]
	]
],
["ガウェイン",4,
	["敏捷 +30","敏捷","30"],
	["最小攻撃力 +20","最小攻撃力","20"],
	["防御力 +20","防御力","20"],
	["最大攻撃力 +20","最大攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["バンガイオン",3,
	["敵の防御力無視 +5%","敵の防御力無視","5"],
	["ダブルダメージ確率 +15%","ダブルダメージ確率","15"],
	["スキル攻撃力 +15","スキル攻撃力","15"],
	[
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +30","エクセレントダメージ","30"],
		["力 +30","力","30"],
		["魔力 +10%","魔力","10"]
	]
],
["ヴィシャス",3,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["ダメージ増加 +15","ダメージ増加","15"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["最小攻撃力 +20","最小攻撃力","20"],
		["最大攻撃力 +30","最大攻撃力","30"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["イシス",3,
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["エナジー +30","エナジー","30"],
	[
		["魔力 +10%","魔力","10"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["アルアン",3,
	["ダメージ増加 +10","ダメージ増加","10"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["ミュレン",3,
	["スキル攻撃力 +10","スキル攻撃力","10"],
	["魔力 +10%","魔力","10"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["防御力 +25","防御力","25"],
		["両手剣装備時ダメージ増加 +20%","両手剣装備時ダメージ増加","20"]
	]
],
["アグニス",3,
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	["防御力 +40","防御力","40"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["ブロイ",3,
	["ダメージ増加 +20","ダメージ増加","20"],
	["スキル攻撃力 +20","スキル攻撃力","20"],
	["エナジー +30","エナジー","30"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"],
		["統率 +30","統率","30"]
	]
],
["クロノ",3,
	["ダブルダメージ確率 +20%","ダブルダメージ確率","20"],
	["防御力 +60","防御力","60"],
	["スキル攻撃力 +30","スキル攻撃力","30"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["クリティカルダメージ +20","クリティカルダメージ","20"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["エクセレントダメージ +20","エクセレントダメージ","20"]
	]
],
["セメデン",3,
	["魔力 +15%","魔力","15"],
	["スキル攻撃力 +25","スキル攻撃力","25"],
	["エナジー +30","エナジー","30"],
	[
		["クリティカルダメージ確率 +15%","クリティカルダメージ確率","15"],
		["エクセレントダメージ確率 +15%","エクセレントダメージ確率","15"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["無名",3,
	["生命 +50","生命","50"],
	["敏捷 +50","敏捷","50"],
	["盾装備時、防御力 +25%","盾装備時、防御力","25"],
	[
		["ダメージ増加 +30","ダメージ増加","30"]
	]
],
["ミスト",2,
	["体力 +20","体力","20"],
	["スキル攻撃力 +30","スキル攻撃力","30"],
	[
		["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
		["敏捷 +20","敏捷","20"]
	]
],
["グリード",4,
	["最大攻撃力 +10","最大攻撃力","10"],
	["最大攻撃力 +20","最大攻撃力","20"],
	["最大攻撃力 +30","最大攻撃力","30"],
	["最大攻撃力 +40","最大攻撃力","40"],
	[
		["スキル攻撃力 +40","スキル攻撃力","40"],
		["力 +40","力","40"]
	]
],
["クラウド",1,
	["クリティカルダメージ確率 +20%","クリティカルダメージ確率","20"],
	[
		["クリティカルダメージ +50","クリティカルダメージ","50"]
	]
],
["レイブ",2,
	["スキル攻撃力 +20","スキル攻撃力","20"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["両手剣装備時ダメージ増加 +30%","両手剣装備時ダメージ増加","30"],
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["バネク",2,
	["魔力 +10%","魔力","10"],
	["エナジー +20","エナジー","20"],
	[
		["スキル攻撃力 +30","スキル攻撃力","30"],
		["マナ +100","マナ","100"]
	]
],
["シリオン",3,
	["ダブルダメージ確率 +5%","ダブルダメージ確率","5"],
	["クリティカルダメージ確率 +5%","クリティカルダメージ確率","5"],
	["防御力 +20","防御力","20"],
	[
		["力 +50","力","50"],
		["敏捷 +50","敏捷","50"],
		["体力 +50","体力","50"],
		["エナジー +50","エナジー","50"]
	]
],
["ミネ",2,
	["エナジー +30","エナジー","30"],
	["防御力 +30","防御力","30"],
	[
		["マナ +100","マナ","100"],
		["スキル攻撃力 +15","スキル攻撃力","15"]
	]
],
["ドラーク",3,
	["敏捷 +20","敏捷","20"],
	["ダメージ増加 +25","ダメージ増加","25"],
	["ダブルダメージ確率 +20%","ダブルダメージ確率","20"],
	[
		["防御力 +40","防御力","40"],
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"]
	]
],
["フェイズ",2,
	["生命 +100","生命","100"],
	["マナ +100","マナ","100"],
	[
		["防御力 +100","防御力","100"]
	]
],
["アルビアン",1,
	["敏捷 +30","敏捷","30"],
	[
		["敵の防御力無視 +5%","敵の防御力無視","5"]
	]
],
["カリス",2,
	["スキル攻撃力 +15","スキル攻撃力","15"],
	["ダブルダメージ確率 +10%","ダブルダメージ確率","10"],
	[
		["クリティカルダメージ確率 +10%","クリティカルダメージ確率","10"],
		["敏捷 +40","敏捷","40"]
	]
]
];