package Data.Database{
	internal class SetAccessory{
		public static var data:Array = [
["狂戦士の氷のリング",6,"敏捷","狂戦士"],
["カンタータの毒のリング",7,"体力","カンタータ"],
["カンタータの風のリング",9,"敏捷","カンタータ"],
["ヴィシャスの地のリング",10,"力","ヴィシャス"],
["アポロの魔法のリング",11,"エナジー","アポロ"],
["アヌビスの炎のリング",8,"エナジー","アヌビス"],
["セトの地のリング",10,"力","セト"],
["クロノの魔法のリング",11,"エナジー","クロノ"],
["ミュレンの炎のリング",8,"エナジー","ミュレン"],
["アグニスの毒のリング",7,"体力","アグニス"],
["アプルナスの稲妻のネックレス",0,"エナジー","アプルナス"],
["ガルーダの炎のネックレス",1,"力","ガルーダ"],
["アポロの氷のネックレス",2,"力","アポロ"],
["阿修羅の風のネックレス",3,"敏捷","阿修羅"],
["ガウェインのスキルのネックレス",5,"","ガウェイン"],
["バンガイオンの水のネックレス",4,"体力","バンガイオン"],
["ブロイの氷のネックレス",2,"力","ブロイ"],
["アルヴィトの水のネックレス",4,"体力","アルヴィト"],
["フリッグの風のネックレス",3,"敏捷","フリッグ"],
["エルルーンの氷のリング",6,"敏捷","エルルーン"],
["アピスの炎のネックレス",1,"力","アピス"],
["テュールの稲妻のネックレス",0,"エナジー","テュール"],
["ホルスのスキルのネックレス",5,"","ホルス"],
["マグニの風のリング",9,"敏捷","マグニ"]
];
	}
}